lkolbly/cmsis-svd/data/TexasInstruments/LM4F132H5QC.svd
        <register>
          <name>SSEMUX0</name>
          <description>ADC Sample Sequence Extended Input Multiplexer Select 0</description>
          <addressOffset>0x00000058</addressOffset>
          <fields>
            <field>
              <name>ADC_SSEMUX0_EMUX0</name>
              <description>1st Sample Input Select (Upper Bit)</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSEMUX0_EMUX1</name>
              <description>2th Sample Input Select (Upper Bit)</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSEMUX0_EMUX2</name>
              <description>3rd Sample Input Select (Upper Bit)</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSEMUX0_EMUX3</name>
              <description>4th Sample Input Select (Upper Bit)</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADC_SSEMUX0_EMUX4</name>
              <description>5th Sample Input Select (Upper Bit)</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADC_SSEMUX0_EMUX5</name>
              <description>6th Sample Input Select (Upper Bit)</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADC_SSEMUX0_EMUX6</name>
              <description>7th Sample Input Select (Upper Bit)</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADC_SSEMUX0_EMUX7</name>
              <description>8th Sample Input Select (Upper Bit)</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSMUX1</name>
          <description>ADC Sample Sequence Input Multiplexer Select 1</description>
          <addressOffset>0x00000060</addressOffset>
          <fields>
            <field>
              <name>ADC_SSMUX1_MUX0</name>
              <description>1st Sample Input Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX1_MUX1</name>
              <description>2nd Sample Input Select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX1_MUX2</name>
              <description>3rd Sample Input Select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX1_MUX3</name>
              <description>4th Sample Input Select</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSCTL1</name>
          <description>ADC Sample Sequence Control 1</description>
          <addressOffset>0x00000064</addressOffset>
          <fields>
            <field>
              <name>ADC_SSCTL1_D0</name>
              <description>1st Sample Diff Input Select</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_END0</name>
              <description>1st Sample is End of Sequence</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_IE0</name>
              <description>1st Sample Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_TS0</name>
              <description>1st Sample Temp Sensor Select</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_D1</name>
              <description>2nd Sample Diff Input Select</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_END1</name>
              <description>2nd Sample is End of Sequence</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_IE1</name>
              <description>2nd Sample Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_TS1</name>
              <description>2nd Sample Temp Sensor Select</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_D2</name>
              <description>3rd Sample Diff Input Select</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_END2</name>
              <description>3rd Sample is End of Sequence</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_IE2</name>
              <description>3rd Sample Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_TS2</name>
              <description>3rd Sample Temp Sensor Select</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_D3</name>
              <description>4th Sample Diff Input Select</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_END3</name>
              <description>4th Sample is End of Sequence</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_IE3</name>
              <description>4th Sample Interrupt Enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL1_TS3</name>
              <description>4th Sample Temp Sensor Select</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFIFO1</name>
          <description>ADC Sample Sequence Result FIFO 1</description>
          <addressOffset>0x00000068</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFIFO1_DATA</name>
              <description>Conversion Result Data</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFSTAT1</name>
          <description>ADC Sample Sequence FIFO 1 Status</description>
          <addressOffset>0x0000006C</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFSTAT1_TPTR</name>
              <description>FIFO Tail Pointer</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT1_HPTR</name>
              <description>FIFO Head Pointer</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT1_EMPTY</name>
              <description>FIFO Empty</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT1_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSOP1</name>
          <description>ADC Sample Sequence 1 Operation</description>
          <addressOffset>0x00000070</addressOffset>
          <fields>
            <field>
              <name>ADC_SSOP1_S0DCOP</name>
              <description>Sample 0 Digital Comparator Operation</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSOP1_S1DCOP</name>
              <description>Sample 1 Digital Comparator Operation</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSOP1_S2DCOP</name>
              <description>Sample 2 Digital Comparator Operation</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSOP1_S3DCOP</name>
              <description>Sample 3 Digital Comparator Operation</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSDC1</name>
          <description>ADC Sample Sequence 1 Digital Comparator Select</description>
          <addressOffset>0x00000074</addressOffset>
          <fields>
            <field>
              <name>ADC_SSDC1_S0DCSEL</name>
              <description>Sample 0 Digital Comparator Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSDC1_S1DCSEL</name>
              <description>Sample 1 Digital Comparator Select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSDC1_S2DCSEL</name>
              <description>Sample 2 Digital Comparator Select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSDC1_S3DCSEL</name>
              <description>Sample 3 Digital Comparator Select</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSEMUX1</name>
          <description>ADC Sample Sequence Extended Input Multiplexer Select 1</description>
          <addressOffset>0x00000078</addressOffset>
          <fields>
            <field>
              <name>ADC_SSEMUX1_EMUX0</name>
              <description>1st Sample Input Select (Upper Bit)</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSEMUX1_EMUX1</name>
              <description>2th Sample Input Select (Upper Bit)</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSEMUX1_EMUX2</name>
              <description>3rd Sample Input Select (Upper Bit)</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSEMUX1_EMUX3</name>
              <description>4th Sample Input Select (Upper Bit)</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSMUX2</name>
          <description>ADC Sample Sequence Input Multiplexer Select 2</description>
          <addressOffset>0x00000080</addressOffset>
          <fields>
            <field>
              <name>ADC_SSMUX2_MUX0</name>
              <description>1st Sample Input Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX2_MUX1</name>
              <description>2nd Sample Input Select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX2_MUX2</name>
              <description>3rd Sample Input Select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSMUX2_MUX3</name>
              <description>4th Sample Input Select</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSCTL2</name>
          <description>ADC Sample Sequence Control 2</description>
          <addressOffset>0x00000084</addressOffset>
          <fields>
            <field>
              <name>ADC_SSCTL2_D0</name>
              <description>1st Sample Diff Input Select</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_END0</name>
              <description>1st Sample is End of Sequence</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_IE0</name>
              <description>1st Sample Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_TS0</name>
              <description>1st Sample Temp Sensor Select</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_D1</name>
              <description>2nd Sample Diff Input Select</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_END1</name>
              <description>2nd Sample is End of Sequence</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_IE1</name>
              <description>2nd Sample Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_TS1</name>
              <description>2nd Sample Temp Sensor Select</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_D2</name>
              <description>3rd Sample Diff Input Select</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_END2</name>
              <description>3rd Sample is End of Sequence</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_IE2</name>
              <description>3rd Sample Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_TS2</name>
              <description>3rd Sample Temp Sensor Select</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_D3</name>
              <description>4th Sample Diff Input Select</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_END3</name>
              <description>4th Sample is End of Sequence</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_IE3</name>
              <description>4th Sample Interrupt Enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL2_TS3</name>
              <description>4th Sample Temp Sensor Select</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFIFO2</name>
          <description>ADC Sample Sequence Result FIFO 2</description>
          <addressOffset>0x00000088</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFIFO2_DATA</name>
              <description>Conversion Result Data</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFSTAT2</name>
          <description>ADC Sample Sequence FIFO 2 Status</description>
          <addressOffset>0x0000008C</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFSTAT2_TPTR</name>
              <description>FIFO Tail Pointer</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT2_HPTR</name>
              <description>FIFO Head Pointer</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT2_EMPTY</name>
              <description>FIFO Empty</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT2_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSOP2</name>
          <description>ADC Sample Sequence 2 Operation</description>
          <addressOffset>0x00000090</addressOffset>
          <fields>
            <field>
              <name>ADC_SSOP2_S0DCOP</name>
              <description>Sample 0 Digital Comparator Operation</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSOP2_S1DCOP</name>
              <description>Sample 1 Digital Comparator Operation</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSOP2_S2DCOP</name>
              <description>Sample 2 Digital Comparator Operation</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSOP2_S3DCOP</name>
              <description>Sample 3 Digital Comparator Operation</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSDC2</name>
          <description>ADC Sample Sequence 2 Digital Comparator Select</description>
          <addressOffset>0x00000094</addressOffset>
          <fields>
            <field>
              <name>ADC_SSDC2_S0DCSEL</name>
              <description>Sample 0 Digital Comparator Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSDC2_S1DCSEL</name>
              <description>Sample 1 Digital Comparator Select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSDC2_S2DCSEL</name>
              <description>Sample 2 Digital Comparator Select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSDC2_S3DCSEL</name>
              <description>Sample 3 Digital Comparator Select</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSEMUX2</name>
          <description>ADC Sample Sequence Extended Input Multiplexer Select 2</description>
          <addressOffset>0x00000098</addressOffset>
          <fields>
            <field>
              <name>ADC_SSEMUX2_EMUX0</name>
              <description>1st Sample Input Select (Upper Bit)</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSEMUX2_EMUX1</name>
              <description>2th Sample Input Select (Upper Bit)</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSEMUX2_EMUX2</name>
              <description>3rd Sample Input Select (Upper Bit)</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSEMUX2_EMUX3</name>
              <description>4th Sample Input Select (Upper Bit)</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSMUX3</name>
          <description>ADC Sample Sequence Input Multiplexer Select 3</description>
          <addressOffset>0x000000A0</addressOffset>
          <fields>
            <field>
              <name>ADC_SSMUX3_MUX0</name>
              <description>1st Sample Input Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSCTL3</name>
          <description>ADC Sample Sequence Control 3</description>
          <addressOffset>0x000000A4</addressOffset>
          <fields>
            <field>
              <name>ADC_SSCTL3_D0</name>
              <description>1st Sample Diff Input Select</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL3_END0</name>
              <description>1st Sample is End of Sequence</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL3_IE0</name>
              <description>1st Sample Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL3_TS0</name>
              <description>1st Sample Temp Sensor Select</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFIFO3</name>
          <description>ADC Sample Sequence Result FIFO 3</description>
          <addressOffset>0x000000A8</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFIFO3_DATA</name>
              <description>Conversion Result Data</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFSTAT3</name>
          <description>ADC Sample Sequence FIFO 3 Status</description>
          <addressOffset>0x000000AC</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFSTAT3_TPTR</name>
              <description>FIFO Tail Pointer</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT3_HPTR</name>
              <description>FIFO Head Pointer</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT3_EMPTY</name>
              <description>FIFO Empty</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT3_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSOP3</name>
          <description>ADC Sample Sequence 3 Operation</description>
          <addressOffset>0x000000B0</addressOffset>
          <fields>
            <field>
              <name>ADC_SSOP3_S0DCOP</name>
              <description>Sample 0 Digital Comparator Operation</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSDC3</name>
          <description>ADC Sample Sequence 3 Digital Comparator Select</description>
          <addressOffset>0x000000B4</addressOffset>
          <fields>
            <field>
              <name>ADC_SSDC3_S0DCSEL</name>
              <description>Sample 0 Digital Comparator Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSEMUX3</name>
          <description>ADC Sample Sequence Extended Input Multiplexer Select 3</description>
          <addressOffset>0x000000B8</addressOffset>
          <fields>
            <field>
              <name>ADC_SSEMUX3_EMUX0</name>
              <description>1st Sample Input Select (Upper Bit)</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
